# DependentGridlineMayBeDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..DependentGridlineMayBeDeleted Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Type generated gridlines will become non-associated due to changes in the type. Press delete if you wish to remove them instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DependentGridlineMayBeDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DependentGridlineMayBeDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DependentGridlineMayBeDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace